const income = {
    january: [16151, 55949, 70137, 45136, 49190, 85746, 46537, 58593],
    february: [43679, 25844, 62974, 11178, 40025, 93856, 48595, 84732],
    march: [42269, 10904, 86459, 24438, 42722, 23129, 76608, 13671],
    april: [45194, 97613, 26584, 62719, 27967, 53659, 28035, 79239],
    may: [36616, 49060, 67459, 83584, 50099, 55415, 94772, 31271],
    june: [54845, 21759, 50166, 80309, 29303, 39297, 97516, 52640],
    july: [60345, 67141, 99227, 22953, 73348, 99941, 70791, 33341],
    august: [63778, 73431, 69853, 89333, 39887, 26107, 25854, 43582],
    september: [66467, 70527, 19672, 94475, 41071, 85190, 27917, 86128],
    october: [98141, 65225, 41677, 83559, 26152, 34302, 65488, 55304],
    november: [17404, 60557, 55846, 59975, 20081, 29356, 59387, 89327],
    december: [86400, 40165, 24675, 20249, 66239, 60298, 87475, 40187],
    }
    
    const expence = {
    january: [10102, 49140, 44254, 20099, 15471, 46765, 92093, 95992],
    february: [24395, 52867, 79943, 37245, 29099, 32415, 31712, 89499],
    march: [58727, 39141, 85886, 92868, 10686, 34088, 57665, 86309],
    april: [72102, 32149, 49995, 58890, 20246, 97281, 22685, 75192],
    may: [55375, 66635, 98024, 33015, 79318, 20469, 49778, 66550],
    june: [98103, 64306, 46864, 50243, 27641, 42069, 54288, 81565],
    july: [27440, 88336, 43154, 15485, 45394, 95974, 22996, 37571],
    august: [84101, 20096, 65467, 35049, 41729, 14141, 15740, 61236],
    september: [20970, 48191, 97805, 14538, 27727, 75041, 16540, 37578],
    october: [90082, 19020, 69239, 73933, 71537, 60449, 69852, 83688],
    november: [47358, 65180, 20144, 40130, 61160, 23828, 41343, 28949],
    december: [18298, 49034, 42884, 95386, 54418, 77614, 13321, 41241],
    }
    
    const months = ["january", "february", "march", "april", "may", "june", "july", "august", "september", "october", "november", "december"];
    const month = prompt('Введіть місяць року на анг мові').toString().toLowerCase();
    
    console.log(month)
    
    if (months.includes(month)) {
        let totalIncome = 0;
        let totalExpence = 0;

        for (let i = 0; i < income[month].length; i++) {
            totalIncome = totalIncome + income[month][i];
        };

        for (let i = 0; i < expence[month].length; i++) {
            totalExpence = totalExpence + (expence[month][i]);
        };

        let profit = totalIncome - totalExpence;

        if (profit > 0) {
            alert('Цей місяць прибутковий'+profit)
        } else {
            alert('Цей місяць збитковий'+profit)
        }
    
    } else {
        alert('Не правильний місяць');
    }

